{
	"USER_NOT_FOUND": "User account not found. Please check your credentials or create a new account.",
	"SOMETHING_WENT_WRONG": "An unexpected error occurred. Our team has been notified and is working on it.",
	"PROFILE_UPDATED_SUCCESSFULLY": "Your profile has been updated successfully!",
	"FAILED_TO_UPDATE_PROFILE_IMAGE": "Unable to update your profile image. Please try again with a different image.",
	"INVALID_FILE_TYPE": "Please upload only JPG, JPEG or PNG image formats.",
	"FILE_TOO_LARGE": "The file exceeds the maximum size of 5MB. Please compress the image and try again.",
	"FILE_UPLOAD_ERROR": "We encountered an issue while uploading your file. Please try again.",
	"FILE_UPLOAD_SUCCESS": "Your file has been uploaded successfully!",
	"PASSWORD_UPDATED_SUCCESSFULLY": "Your password has been updated successfully. Please use your new password for future logins.",
	"CURRENT_PASSWORD_INCORRECT": "The current password you entered is incorrect. Please try again.",
	"USER_ROLE_UPDATED_SUCCESSFULLY": "User role has been updated successfully.",
	"USER_ROLE_CHANGED_SUCCESSFULLY": "Your account type has been switched successfully. You'll now see the interface for your new role.",
	"ACCOUNT_DELETED_SUCCESSFULLY": "Your account has been successfully deleted. We're sorry to see you go!",
	"ACCESS_DENIED": "You don't have permission to access this resource. Please contact support if you believe this is an error.",
	"DEVICE_ID_UPDATED_SUCCESSFULLY": "Your device has been registered successfully for notifications.",
	"DOCUMENT_UPLOAD_REQUIRED": "Please upload at least one document to continue.",
	"DOCUMENT_UPLOAD_SUCCESS": "Your documents have been uploaded successfully!",
	"DOCUMENT_NOT_FOUND": "The requested document could not be found. It may have been deleted or moved.",
	"DOCUMENT_DELETED_SUCCESS": "Document has been deleted successfully.",
	"INVALID_DOCUMENT_ID": "The document ID provided is invalid or no longer exists.",
	"FAIL_TOKEN_EXPIRED": "Your session has expired. Please log in again to continue.",
	"TOEKN_REQUIRED": "Authentication required. Please log in to access this resource.",
	"ACCOUNT_INACTIVE": "This account is currently inactive or has been deleted. Please contact our support team for assistance.",
	"INVALID_TOKEN": "The authentication token provided is invalid. Please log in again.",
	"FCM_TOKEN_REGISTERED": "Your device has been registered successfully for notifications.",
	"SUCCESS_CHANGE_PASSWORD": "Your password has been changed successfully. You can now log in with your new password.",
	"FORBIDDEN": "Access denied. You don't have permission to perform this action."
}