{
  "ACCOUNT_VERIFICATION_PENDING": "Your account is pending verification. We've sent a new verification code to your email.",
  "ACCOUNT_ALREADY_EXISTS": "An account with this email address already exists. Please try logging in or use a different email.",
  "ACCOUNT_VERIFICATION_SUCCESS": "Your account has been successfully verified! You can now access all features.",
  "ACCOUNT_REGISTERED_SUCCESSFULLY": "Welcome to Good-Busy! Your account has been created successfully.",
  "SOMETHING_WENT_WRONG": "An unexpected error occurred. Our team has been notified and is working to resolve it.",
  "USER_NOT_FOUND": "We couldn't find an account with that email address. Please check your spelling or create a new account.",
  "ACCOUNT_INACTIVE": "This account has been deactivated. Please contact our support team for assistance.",
  "ACCOUNT_PENDING": "Your account is awaiting verification. Please check your email for the verification code we sent you.",
  "INVALID_CREDENTIALS": "The email or password you entered is incorrect. Please try again.",
  "LOGIN_SUCCESS": "Welcome back! You've successfully logged in to your account.",
  "INVALID_OTP": "The verification code you entered is incorrect. Please try again.",
  "OTP_EXPIRED": "Your verification code has expired. We've sent you a new code.",
  "OTP_SENT": "A verification code has been sent to your email address.",
  "PASSWORD_RESET_SUCCESS": "Your password has been reset successfully. You can now log in with your new password.",
  "FAIL_TOKEN_EXPIRED": "Your session has expired for security reasons. Please log in again to continue.",
  "TOKEN_REQUIRED": "Please log in to access this feature.",
  "PROFILE_IMAGE_UPLOAD_FAILED": "We couldn't upload your profile picture, but your account was created successfully. You can add a profile picture later in your settings.",
  "INVALID_FILE_TYPE": "Please upload only JPG, JPEG, or PNG image formats for your profile picture.",
  "FILE_TOO_LARGE": "Your image exceeds the 5MB size limit. Please compress it or choose a smaller image.",
  "FILE_UPLOAD_SUCCESS": "Your file has been uploaded successfully!",
  "VERIFICATION_CODE_SENT": "Your account has been created. Please check your email for the verification code to complete registration.",
  "ACCOUNT_VERIFICATION_REQUIRED": "Your account requires verification. We've sent a new verification code to your email.",
  "OTP_RESENT_SUCCESS": "A new verification code has been sent to your email address.",
  "OTP_REQUEST_TOO_SOON": "Please wait a moment before requesting another verification code.",
  "OTP_MAX_REQUESTS_EXCEEDED": "You've requested too many verification codes today. Please try again tomorrow or contact our support team.",
  "SUCCESS": "Operation completed successfully.",
  "NOT_FOUND": "The requested resource was not found.",
  "BAD_REQUEST": "Your request could not be processed. Please check the data you provided.",
  "UNAUTHORIZED": "You need to log in to access this feature.",
  "FORBIDDEN": "You don't have permission to access this resource.",
  "CONFLICT": "The request could not be completed due to a conflict with the current state of the resource.",
  "TOO_MANY_REQUESTS": "You've made too many requests. Please try again later."
}
