{
	"GOAL_CREATED_SUCCESSFULLY": "Your goal has been created successfully! Start tracking your progress today.",
	"FAILED_TO_CREATE_GOAL": "We couldn't create your goal at this time. Please try again later.",
	"GOALS_RETRIEVED_SUCCESSFULLY": "Your goals have been retrieved successfully.",
	"FAILED_TO_RETRIEVE_GOALS": "We couldn't retrieve your goals at this time. Please try again later.",
	"GOAL_RETRIEVED_SUCCESSFULLY": "Goal details retrieved successfully.",
	"FAILED_TO_RETRIEVE_GOAL": "We couldn't retrieve this goal's details. Please try again later.",
	"GOAL_NOT_FOUND": "The goal you're looking for doesn't exist or has been removed.",
	"INVALID_GOAL_ID": "The goal ID provided is invalid. Please check and try again.",
	"GOAL_UPDATED_SUCCESSFULLY": "Your goal has been updated successfully!",
	"FAILED_TO_UPDATE_GOAL": "We couldn't update your goal at this time. Please try again later.",
	"NOT_AUTHORIZED_TO_UPDATE_GOAL": "You don't have permission to update this goal. Only the goal creator can make changes.",
	"GOAL_DELETED_SUCCESSFULLY": "Your goal has been deleted successfully.",
	"FAILED_TO_DELETE_GOAL": "We couldn't delete your goal at this time. Please try again later.",
	"NOT_AUTHORIZED_TO_DELETE_GOAL": "You don't have permission to delete this goal. Only the goal creator can delete it.",
	"GOAL_LIKED_SUCCESSFULLY": "You've liked this goal. The creator will be notified of your support!",
	"LIKE_REMOVED_SUCCESSFULLY": "You've removed your like from this goal.",
	"FAILED_TO_LIKE_GOAL": "We couldn't process your like at this time. Please try again later.",
	"GOAL_THUMBS_DOWN_SUCCESSFULLY": "You've given this goal a thumbs down.",
	"THUMBS_DOWN_REMOVED_SUCCESSFULLY": "You've removed your thumbs down from this goal.",
	"FAILED_TO_THUMBS_DOWN_GOAL": "We couldn't process your feedback at this time. Please try again later.",
	"DISLIKE_REMOVED_AND_LIKED_SUCCESSFULLY": "Your thumbs down has been changed to a like. Thanks for your support!",
	"LIKE_REMOVED_AND_DISLIKED_SUCCESSFULLY": "Your like has been changed to a thumbs down.",
	"GOAL_COMPLETED_SUCCESSFULLY": "Congratulations! You've marked this goal as complete for today.",
	"GOAL_ALREADY_COMPLETED": "You've already completed this goal today. Keep up the good work!",
	"FAILED_TO_COMPLETE_GOAL": "We couldn't mark your goal as complete. Please try again later.",
	"NOT_AUTHORIZED_TO_COMPLETE_GOAL": "You can only complete goals that you've created.",
	"GOAL_STATS_RETRIEVED_SUCCESSFULLY": "Your goal statistics have been retrieved successfully.",
	"FAILED_TO_RETRIEVE_GOAL_STATISTICS": "We couldn't retrieve your goal statistics at this time. Please try again later.",
	"INVALID_FREQUENCY": "Please select a valid frequency: daily, weekly, or monthly.",
	"TITLE_REQUIRED": "Please provide a title for your goal.",
	"DESCRIPTION_REQUIRED": "Please provide a description for your goal.",
	"FREQUENCY_REQUIRED": "Please select how often you want to track this goal (daily, weekly, or monthly).",
	"SOMETHING_WENT_WRONG": "Something unexpected happened. Our team has been notified and is working on it.",
	"TOEKN_REQUIRED": "Authentication required. Please log in to access this feature.",
	"GOAL_MARKED_AS_COMPLETE": "Congratulations! Your goal has been marked as complete for today.",
	"GOAL_ALREADY_COMPLETED_TODAY": "You've already completed this goal today. Great job staying on track!",
	"GOAL_STATISTICS_RETRIEVED_SUCCESSFULLY": "Your goal progress statistics have been retrieved successfully."
}